#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/2c4a420f-fd26-4da7-9db9-65cbf0e1cf88/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion[0].azurecaf_name.caf_name_pip must be replaced
-/+ resource "azurecaf_name" "caf_name_pip" {
      ~ id            = "fjjblixfamhcidbf" -> (known after apply)
      ~ name          = "lzademo" -> "lzademo-bastion" # forces replacement
      ~ result        = "secure-baseline-2-ase-wus2-pip-lzademo" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.bastion[0].azurerm_bastion_host.bastion must be replaced
-/+ resource "azurerm_bastion_host" "bastion" {
      ~ dns_name               = "bst-a8088446-d9ec-40d0-9170-011026643819.bastion.azure.com" -> (known after apply)
      ~ id                     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/bastionHosts/secure-baseline-2-ase-wus2-vnet-lzademo" -> (known after apply)
        name                   = "secure-baseline-2-ase-wus2-vnet-lzademo"
        tags                   = {
            "Environment" = "dev"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "bastion"
        }
        # (9 unchanged attributes hidden)

      ~ ip_configuration {
            name                 = "bastionHostIpConfiguration"
          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/publicIPAddresses/secure-baseline-2-ase-wus2-pip-lzademo" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.bastion[0].azurerm_public_ip.bastion_pip must be replaced
-/+ resource "azurerm_public_ip" "bastion_pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/publicIPAddresses/secure-baseline-2-ase-wus2-pip-lzademo" -> (known after apply)
      ~ ip_address              = "172.171.114.221" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "secure-baseline-2-ase-wus2-pip-lzademo" # forces replacement -> (known after apply) # forces replacement
        tags                    = {
            "Environment" = "dev"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "bastion"
        }
      - zones                   = [] -> null
        # (8 unchanged attributes hidden)
    }

  # module.vnetSpoke[0].azurerm_subnet.this[0] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/virtualNetworks/secure-baseline-2-ase-wus2-vnet-lzademo-dev/subnets/hostingEnvironment"
        name                                           = "hostingEnvironment"
        # (9 unchanged attributes hidden)

      ~ delegation {
            name = "Microsoft.Web/serverFarms"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                ]
                name    = "Microsoft.Web/hostingEnvironments"
            }
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.bastion[0].azurecaf_name.caf_name_pip must be replaced%0A-/+ resource "azurecaf_name" "caf_name_pip" {%0A      ~ id            = "fjjblixfamhcidbf" -> (known after apply)%0A      ~ name          = "lzademo" -> "lzademo-bastion" # forces replacement%0A      ~ result        = "secure-baseline-2-ase-wus2-pip-lzademo" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.bastion[0].azurerm_bastion_host.bastion must be replaced%0A-/+ resource "azurerm_bastion_host" "bastion" {%0A      ~ dns_name               = "bst-a8088446-d9ec-40d0-9170-011026643819.bastion.azure.com" -> (known after apply)%0A      ~ id                     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/bastionHosts/secure-baseline-2-ase-wus2-vnet-lzademo" -> (known after apply)%0A        name                   = "secure-baseline-2-ase-wus2-vnet-lzademo"%0A        tags                   = {%0A            "Environment" = "dev"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "bastion"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A      ~ ip_configuration {%0A            name                 = "bastionHostIpConfiguration"%0A          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/publicIPAddresses/secure-baseline-2-ase-wus2-pip-lzademo" # forces replacement -> (known after apply) # forces replacement%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.bastion[0].azurerm_public_ip.bastion_pip must be replaced%0A-/+ resource "azurerm_public_ip" "bastion_pip" {%0A      + fqdn                    = (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/publicIPAddresses/secure-baseline-2-ase-wus2-pip-lzademo" -> (known after apply)%0A      ~ ip_address              = "172.171.114.221" -> (known after apply)%0A      - ip_tags                 = {} -> null%0A      ~ name                    = "secure-baseline-2-ase-wus2-pip-lzademo" # forces replacement -> (known after apply) # forces replacement%0A        tags                    = {%0A            "Environment" = "dev"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 2] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "bastion"%0A        }%0A      - zones                   = [] -> null%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.vnetSpoke[0].azurerm_subnet.this[0] will be updated in-place%0A  ~ resource "azurerm_subnet" "this" {%0A        id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/network-secure-baseline-2-ase-wus2-rg-lzademo/providers/Microsoft.Network/virtualNetworks/secure-baseline-2-ase-wus2-vnet-lzademo-dev/subnets/hostingEnvironment"%0A        name                                           = "hostingEnvironment"%0A        # (9 unchanged attributes hidden)%0A%0A      ~ delegation {%0A            name = "Microsoft.Web/serverFarms"%0A%0A          ~ service_delegation {%0A              ~ actions = [%0A                  - "Microsoft.Network/virtualNetworks/subnets/action",%0A                  + "Microsoft.Network/virtualNetworks/subnets/join/action",%0A                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",%0A                ]%0A                name    = "Microsoft.Web/hostingEnvironments"%0A            }%0A        }%0A    }%0A%0APlan: 3 to add, 1 to change, 3 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-ase/terraform`, Workflow: `Scenario 2: Terraform Single-tenant ASEv3 Secure Baseline`*